Revit 2027 API
CableTrayConduitBase.IsWithFitting Method
 Return whether its cable tray/conduit type is with fitting
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsWithFitting()
Public Function IsWithFitting As Boolean
public:
bool IsWithFitting()
member IsWithFitting : unit -> bool
Return Value
Boolean
 return true if its type is with fitting type.
See Also
Reference
CableTrayConduitBase Class
Autodesk.Revit.DB.Electrical Namespace